export const WILAYAS = [
  "أدرار", "الشلف", "الأغواط", "أم البواقي", "باتنة", "بجاية", "بسكرة", "بشار", "البليدة", "البويرة",
  "تمنراست", "تبسة", "تلمسان", "تيارت", "تيزي وزو", "الجزائر", "الجلفة", "جيجل", "سطيف", "سعيدة",
  "سكيكدة", "سيدي بلعباس", "عنابة", "قالمة", "قسنطينة", "المدية", "مستغانم", "المسيلة", "معسكر", "ورقلة",
  "وهران", "البيض", "إليزي", "برج بوعريريج", "بومرداس", "الطارف", "تندوف", "تيسمسيلت", "الوادي", "خنشلة",
  "سوق أهراس", "تيبازة", "ميلة", "عين الدفلى", "النعامة", "عين تموشنت", "غرداية", "غليزان",
  "تيميمون", "برج باجي مختار", "أولاد جلال", "بني عباس", "عين صالح", "عين قزام", "تقرت", "جانت", "المغير", "المنيعة"
];

export const BRANDS = [
  "Renault", "Hyundai", "Volkswagen", "Peugeot", "Dacia", "Toyota", "Kia", "Seat", "Suzuki", "Chevrolet",
  "Ford", "Fiat", "Nissan", "Mercedes-Benz", "BMW", "Audi", "Skoda", "Citroen", "Chery", "Geely", "MG", "Changan"
];

export const FUEL_TYPES = ['بنزين', 'بنزين + غاز', 'ديزل', 'كهرباء'] as const;

export const CONDITIONS = ['جيدة', 'متوسطة', 'أقل من متوسطة'] as const;

export const REPAIR_OPTIONS = [
  "فيها فوال",
  "معاودة على نظافة",
  "كايو محطوط",
  "باب محطوط",
  "فيها راكور",
  "لال محطوط",
  "موتور معاود",
  "سيسبونسيو جديدة"
];
